app/controllers/hosts_controller.rb

  def index
    @hosts = Host.find_by user: @user.id
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def create
    @host = Host.new(host_params)
    @note.user = @user.id

    if @host.save
---
INSERT INTO "hosts" ("name", "animals", "walker", "grooming", "rate", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @host.update(host_params)
---
UPDATE "hosts" SET "grooming" = $1, "rate" = $2, "updated_at" = $3 WHERE "hosts"."id" = $4  [["grooming", "yes"], ["rate", 45], ["updated_at", "2020-12-24 15:23:44.447427"], ["id", 1]]

  def destroy
    @host.destroy
---
DELETE FROM "hosts" WHERE "hosts"."id" = $1  [["id", 1]]

    def set_host
      @host = Host.find(params[:id])
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]